#ifndef 	_24C0x_h_
#define 	_24C0x_h_
#define delay4us() _nop_();_nop_();_nop_();_nop_();
sbit sda=P3^5;
sbit scl=P3^4;
sbit WP =P3^3;
/********************************************************************
* 名称 : x24c02_init()
* 功能 : 24c02初始化子程序
* 输入 : 无
* 输出 : 无
***********************************************************************/
extern void x24c02_init(void);
/********************************************************************
* 名称 : x24c02_read()
* 功能 : 从24c02中读出值
* 输入 : address(要在这个地址读取值）
* 输出 : 从24c02中读出的值
***********************************************************************/
extern unsigned char x24c02_read(unsigned char address);
/********************************************************************
* 名称 : x24c02_write()
* 功能 : 想24c02中写入数据
* 输入 : address(地址） ， info（值）
* 输出 : 无
***********************************************************************/
extern void x24c02_write(unsigned char address, unsigned char info);

#endif











