#include <reg52.h>
#include <intrins.h>
#include"24C0x.h"
//#include"mytype.h"
#define uchar unsigned char
#define uint unsigned int
/********************************************************************
* 文件名  ： EEPROM_24C02.c
* 描述    :  该文件实现对24C02的操作。
		     确认试验是否成功：电源上电后，数码管的值在递增，观察值。关闭电源，待几秒后上电，
		     数码管显示的值会从断电钱的那个值开始显示。
* 创建人  ： 陶奕恺，2013年4月3日
***********************************************************************/
/********************************************************************
* 名称 : flash()
* 功能 : 延时,时间为2个NOP，大概为2US
* 输入 : 无
* 输出 : 无
***********************************************************************/
void flash(void) 
{
	_nop_();
	_nop_();
	_nop_();
	_nop_();
}

/********************************************************************
* 名称 : x24c02_init()
* 功能 : 24c02初始化子程序
* 输入 : 无
* 输出 : 无
***********************************************************************/
void x24c02_init(void) 
{	WP=0;
	scl = 1;
	flash();
	sda = 0;
	flash();
}

/********************************************************************
* 名称 : start(void)
* 功能 : 启动I2C总线
* 输入 : 无
* 输出 : 无
***********************************************************************/
void start(void)
{
	scl = 1; 
	flash();
	sda = 1;
	flash(); 
	sda = 1; 
	flash(); 
	scl = 0; 
	flash();
}

/********************************************************************
* 名称 : stop()
* 功能 : 停止I2C总线
* 输入 : 无
* 输出 : 无
***********************************************************************/
void stop() 
{
	scl = 0;
	flash();
	sda = 0; 
	flash();
	scl = 1;
	flash();
	sda = 0;
	flash();
}

/********************************************************************
* 名称 : writex()
* 功能 : 写一个字节
* 输入 : j（需要写入的值）
* 输出 : 无
***********************************************************************/
void writex(uchar j)
{  
	uchar i,temp;
	temp = j;
	for(i=0; i<8; i++)
	{
		scl = 0; 
		flash(); 
		sda = (bit)(temp & 0x80); 
		flash();
		scl = 1; 
		flash();
		temp = temp << 1; 
	}
	scl = 0;
	flash(); 
}

/********************************************************************
* 名称 : readx()
* 功能 : 读一个字节
* 输入 : 无
* 输出 : 读出的值
***********************************************************************/
uchar readx(void)
{
	uchar i, j, k = 0;
	for(i=0; i<8; i++)
	{
		scl = 0;
		flash();		
		if(sda == 1)
		{
			j = 1;
		}
		else j = 0;
		k = (k << 1) | j; 
		scl = 1;
		flash();
	} 
	return(k);
}

/********************************************************************
* 名称 : ack()
* 功能 : I2C总线时钟
* 输入 : 无
* 输出 : 无
***********************************************************************/
void ack(void)
{
	uchar i = 0;
	scl = 1;
	flash();
	while((sda == 1) && (i < 255)) 
	{
		i++;
	}
	scl = 0;
	flash();
}

/********************************************************************
* 名称 : x24c02_read()
* 功能 : 从24c02中读出值
* 输入 : address(要在这个地址读取值）
* 输出 : 从24c02中读出的值
***********************************************************************/
uchar x24c02_read(uchar address)
{
	uchar i;
	start();
	writex(0xa8);
	ack();
	writex(address);
	ack();
	start();
	writex(0xa9);
	ack();
	i = readx();
	stop();
	return(i);
}

/********************************************************************
* 名称 : x24c02_write()
* 功能 : 想24c02中写入数据
* 输入 : address(地址） ， info（值）
* 输出 : 无
***********************************************************************/
void x24c02_write(uchar address, uchar info)
{
	start();
	writex(0xa8);
	ack();
	writex(address);
	ack();
	writex(info);
	ack();
	stop();
}
